m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#if !defined(__FSL_MCG_HAL_H__)
#define __FSL_MCG_HAL_H__

#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include "fsl_device_registers.h"
#if FSL_FEATURE_SOC_MCG_COUNT

/*! @addtogroup mcg_hal*/
/*! @{*/

/*! @file fsl_mcg_hal.h */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief MCG constant definitions*/
enum _mcg_constant
{
   kMcgConstant0         = (0u),
   kMcgConstant31250     = (31250u),
   kMcgConstant32768     = (32768u),
   kMcgConstant39063     = (39063u),
   kMcgConstant8000000   = (8000000u),
   kMcgConstant16000000  = (16000000u),
};

/*! @brief MCG internal reference clock source select */
typedef enum _mcg_fll_src
{
    kMcgFllSrcExternal,    /*!< External reference clock is selected */
    kMcgFllSrcInternal     /*!< The slow internal reference clock is selected */
} mcg_fll_src_t;

/*! @brief MCG OSC frequency range select */
typedef enum _osc_range
{
    kOscRangeLow,         /*!< Low frequency range selected for the crystal OSC */
    kOscRangeHigh,        /*!< High frequency range selected for the crystal OSC */
    kOscRangeVeryHigh,    /*!< Very High frequency range selected for the crystal OSC */
    kOscRangeVeryHigh1    /*!< Very High frequency range selected for the crystal OSC */
} osc_range_t;

/*! @brief MCG high gain oscillator select */
typedef enum _osc_gain
{
    kOscGainLow,          /*!< Configure crystal oscillator for low-power operation */
    kOscGainHigh          /*!< Configure crystal oscillator for high-gain operation */
} osc_gain_t;

/*! @brief MCG external reference clock select */
typedef enum _osc_src
{
    kOscSrcExt,    /*!< External reference clock requested */
    kOscSrcOsc     /*!< Oscillator requested */
} osc_src_t;

/*! @brief MCG internal reference clock select */
typedef enum _mcg_irc_mode
{
    kMcgIrcSlow,        /*!< Slow internal reference clock selected */
    kMcgIrcFast         /*!< Fast internal reference clock selected */
} mcg_irc_mode_t;

/*! @brief MCG DCO Maximum Frequency with 32.768 kHz Reference */
typedef enum _mcg_dmx32_select
{
    kMcgDmx32Default, /*!< DCO has a default range of 25% */
    kMcgDmx32Fine     /*!< DCO is fine-tuned for maximum frequency with 32.768 kHz reference */
} mcg_dmx32_select_t;

/*! @brief MCG DCO range select */
typedef enum _mcg_dco_range_select
{
    kMcgDcoRangeSelLow,          /*!< Low frequency range */
    kMcgDcoRangeSelMid,          /*!< Mid frequency range*/
    kMcgDcoRangeSelMidHigh,      /*!< Mid-High frequency range */
    kMcgDcoRangeSelHigh          /*!< High frequency range */
} mcg_dco_range_select_t;

/*! @brief MCG PLL external reference clock select */
typedef enum _mcg_pll_ref_mode
{
    kMcgPllRefOsc0,    /*!< Selects OSC0 clock source as its external reference clock */
    kMcgPllRefOsc1     /*!< Selects OSC1 clock source as its external reference clock */
} mcg_pll_ref_mode_t;

/*! @brief MCGOUT clock source. */
typedef enum _mcg_clkout_src
{
    kMcgClkOutSrcOut,                   /*!< Output of the FLL is selected (reset default) */
    kMcgClkOutSrcInternal,              /*!< Internal reference clock is selected */
    kMcgClkOutSrcExternal,              /*!< External reference clock is selected */
} mcg_clkout_src_t;

/*! @brief MCG clock mode status */
typedef enum _mcg_clkout_stat
{
    kMcgClkOutStatFll,                   /*!< Output of the FLL is selected (reset default) */
    kMcgClkOutStatInternal,              /*!< Internal reference clock is selected */
    kMcgClkOutStatExternal,              /*!< External reference clock is selected */
    kMcgClkOutStatPll                    /*!< Output of the PLL is selected */
} mcg_clkout_stat_t;

/*! @brief MCG Automatic Trim Machine Select */
typedef enum _mcg_atm_select
{
    kMcgAtmSel32k,   /*!< 32 kHz Internal Reference Clock selected */
    kMcgAtmSel4m     /*!< 4 MHz Internal Reference Clock selected */
} mcg_atm_select_t;

/*! @brief MCG OSC Clock Select */
typedef enum _mcg_oscsel_select
{
    kMcgOscselOsc,                  /*!< Selects System Oscillator (OSCCLK) */
    kMcgOscselRtc,                  /*!< Selects 32 kHz RTC Oscillator */
#if FSL_FEATURE_MCG_HAS_IRC_48M
    kMcgOscselIrc                   /*!< Selects 48 MHz IRC Oscillator */
#endif
} mcg_oscsel_select_t;

/*! @brief MCG OSC monitor mode */
typedef enum _mcg_osc_monitor_mode
{
    kMcgOscMonitorInt,     /*!< Generate interrupt when clock lost. */
    kMcgOscMonitorReset    /*!< Generate reset when clock lost.     */
} mcg_osc_monitor_mode_t;

/*! @brief MCG PLLCS select */
typedef enum _mcg_pll_clk_select
{
    kMcgPllClkSelPll0,            /*!< PLL0 output clock is selected */
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL    
    kMcgPllClkSelExtPll,          /* External PLL clock is selected */
#else
    kMcgPllClkSelPll1,            /* PLL1 output clock is selected */
#endif
} mcg_pll_clk_select_t;

