m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
/*! @brief MCG auto trim machine error code. */
typedef enum _mcg_atm_error
{
    kMcgAtmErrorNone,               /*!< No error. */
    kMcgAtmErrorBusClockRange,      /*!< Bus clock frequency is not in 8MHz to 16 MHz. */
    kMcgAtmErrorDesireFreqRange,    /*!< Desired frequency is out of range. */
    kMcgAtmErrorIrcUsed,            /*!< IRC clock is used to generate system clock.  */
    kMcgAtmErrorTrimValueInvalid,   /*!< The auto trim compare value ACT is invalid. */
    kMcgAtmErrorHardwareFail        /*!< ATC[ATMF] fail flag asserts. */
} mcg_atm_error_t;

/*! @brief MCG status. */
typedef enum _mcg_status
{
    kStatus_MCG_Success = 0U, /*!< Success.          */
    kStatus_MCG_Fail    = 1U, /*!< Execution failed. */
} mcg_status_t;

extern uint32_t g_xtal0ClkFreq;           /* EXTAL0 clock */
#if FSL_FEATURE_MCG_HAS_OSC1
extern uint32_t g_xtal1ClkFreq;           /* EXTAL1 clock */
#endif
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
extern uint32_t g_extPllClkFreq;          /* External PLL clock */
#endif
extern uint32_t g_xtalRtcClkFreq;         /* EXTAL RTC clock */

extern uint32_t g_fastInternalRefClkFreq;  /* Fast IRC clock */
extern uint32_t g_slowInternalRefClkFreq;  /* Slow IRC clock */

#if FSL_FEATURE_MCG_HAS_IRC_48M
#define CPU_INTERNAL_IRC_48M 48000000U
#endif

#if defined(MCG_BWR_C6_CME)
#define MCG_BWR_C6_CME0 MCG_BWR_C6_CME
#endif

#if defined(MCG_BRD_C6_CME)
#define MCG_BRD_C6_CME0 MCG_BRD_C6_CME
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus*/

/*! @name MCG out clock access API*/
/*@{*/

/*!
 * @brief Tests the external clock frequency.
 *
 * This function tests the external clock frequency, including OSC, RTC and IRC48M.
 * If the OSC is not initialized, this function returns 0.
 *
 * @param base  Base address for current MCG instance.
 * @param oscselVal    External OSC selection.
 * @return MCG external reference clock frequency.
 */
uint32_t CLOCK_HAL_TestOscFreq(MCG_Type * base, mcg_oscsel_select_t oscselVal);

/*!
 * @brief Tests the FLL external reference frequency based on the input parameters.
 *
 * This function calculates the MCG FLL external reference clock value in
 * frequency(Hertz) based on the input parameters.
 *
 * @param base  Base address for current MCG instance.
 * @param extFreq   External OSC frequency.
 * @param frdivVal  FLL external reference divider value (FRDIV).
 * @param range0    OSC0 frequency range selection.
 * @param oscsel    External OSC selection.
 * @return MCG FLL external reference clock frequency.
 */
uint32_t CLOCK_HAL_TestFllExternalRefFreq(MCG_Type * base,
                                          uint32_t extFreq,
                                          uint8_t  frdivVal,
                                          osc_range_t range0,
                                          mcg_oscsel_select_t oscsel);
/*!
 * @brief Gets the current MCG FLL clock.
 *
 * This function returns the FLL reference clock frequency based on the
 * current MCG configurations and settings. FLL should be properly configured
 * in order to get the valid value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of FLL reference clock.
 */
uint32_t CLOCK_HAL_GetFllRefClk(MCG_Type * base);

/*!
 * @brief Calculates the FLL frequency based on the input parameters.
 *
 * This function calculates the FLL frequency based on input parameters.
 *
 * @param base  Base address for current MCG instance.
 * @param fllRef    FLL reference clock frequency.
 * @param dmx32     DCO max 32K setting.
 * @param drs       DCO range seletion.
 * @return Frequency value in Hertz of the mcgfllclk.
 */
uint32_t CLOCK_HAL_TestFllFreq(MCG_Type * base,
                               uint32_t fllRef,
                               mcg_dmx32_select_t dmx32,
                               mcg_dco_range_select_t drs);

/*!
 * @brief Gets the current MCG FLL clock.
 *
 * This function  returns the mcgfllclk value in frequency(Hertz) based on the
 * current MCG configurations and settings. FLL should be properly configured
 * get the valid value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of the mcgpllclk.
 */
uint32_t CLOCK_HAL_GetFllClk(MCG_Type * base);

#if FSL_FEATURE_MCG_HAS_PLL
/*!
 * @brief Calculates the PLL PRDIV and VDIV.
 *
 * This function calculates the proper PRDIV and VDIV to generate desired PLL
 * output frequency with input reference clock frequency. It returns the closest
 * frequency PLL could generate, the corresponding PRDIV/VDIV are returned from
 * parameters. If desire frequency is not valid, this function returns 0.
 *
 * @param refFreq PLL reference frequency.
 * @param desireFreq Desired PLL output frequency.
 * @param prdiv   PRDIV value to generate desired PLL frequency.
 * @param vdiv    VDIV value to generate desired PLL frequency.
 * @return Closest frequency PLL could generate.
 */
uint32_t CLOCK_HAL_CalculatePllDiv(uint32_t refFreq,
                                   uint32_t desireFreq,
                                   uint8_t *prdiv,
                                   uint8_t *vdiv);

/*!
 * @brief Gets the current MCG PLL/PLL0 clock.
 *
 * This function  returns the mcgpllclk/mcgpll0 value in frequency(Hertz) based
 * on the current MCG configurations and settings. PLL/PLL0 should be properly 
 * configured in order to get the valid value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of the mcgpllclk or the mcgpll0clk.
 */
uint32_t CLOCK_HAL_GetPll0Clk(MCG_Type * base);
#endif

#if FSL_FEATURE_MCG_HAS_PLL1
/*!
 * @brief Gets the current MCG PLL1 clock.
 *
 * This function  returns the mcgpll1clk value in frequency (Hertz) based
 * on the current MCG configurations and settings. PLL1 should be properly configured
 * in order to get the valid value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of mcgpll1clk.
 */
uint32_t CLOCK_HAL_GetPll1Clk(MCG_Type * base);
#endif

#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
/*!
 * @brief Gets the current external PLL clock.
 *
 * This function  returns the extpllclk value in frequency (Hertz). The external PLL
 * is configured outside of the MCG module.
 *
 * @param base  Base address for current MCG instance.
 * @return value Frequency value in Hertz of mcgpll1clk.
 */
uint32_t CLOCK_HAL_GetExtPllClk(MCG_Type * base);
#endif

/*!
 * @brief Gets the current MCG internal reference clock(MCGIRCLK).
 *
 * This function  returns the MCGIRCLK value in frequency (Hertz) based
 * on the current MCG configurations and settings. It does not check if the
 * MCGIRCLK is enabled or not, just calculate and return the value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of the MCGIRCLK.
 */
uint32_t CLOCK_HAL_GetInternalRefClk(MCG_Type * base);

/*!
 * @brief Gets the current MCG fixed frequency clock(MCGFFCLK).
 *
 * This function get the MCGFFCLK, it is only valid when its frequency is not
 * more than MCGOUTCLK/8. If MCGFFCLK is invalid, this function returns 0.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of MCGFFCLK.
 */
uint32_t CLOCK_HAL_GetFixedFreqClk(MCG_Type * base);

/*!
 * @brief Gets the current MCG out clock.
 *
 * This function  returns the mcgoutclk value in frequency (Hertz) based on the
 * current MCG configurations and settings. The configuration should be
 * properly done in order to get the valid value.
 *
 * @param base  Base address for current MCG instance.
 * @return Frequency value in Hertz of mcgoutclk.
 */
uint32_t CLOCK_HAL_GetOutClk(MCG_Type * base);

/*@}*/

