m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
/*! @name MCG control register access API*/
/*@{*/

/*!
 * @brief Sets the Clock Source Select
 *
 * This function  selects the clock source for the MCGOUTCLK.
 *
 * @param base  Base address for current MCG instance.
 * @param select    Clock source selection
 *                  - 00: Output of FLL or PLLCS is selected(depends on PLLS control bit)
 *                  - 01: Internal reference clock is selected.
 *                  - 10: External reference clock is selected.
 *                  - 11: Reserved.
 */
static inline void CLOCK_HAL_SetClkOutSrc(MCG_Type * base, mcg_clkout_src_t select)
{
    MCG_BWR_C1_CLKS(base, select);
}

/*!
 * @brief Gets the Clock Mode Status.
 *
 * This function  gets the Clock Mode Status. These bits indicate the current clock mode.
 * The CLKST bits do not update immediately after a write to the CLKS bits due to
 * internal synchronization between clock domains.
 *
 * @param base  Base address for current MCG instance.
 * @return Clock Mode Status
 *                 - 00: Output of the FLL is selected (reset default).
 *                 - 01: Internal reference clock is selected.
 *                 - 10: External reference clock is selected.
 *                 - 11: Output of the PLL is selected.
 */
static inline mcg_clkout_stat_t CLOCK_HAL_GetClkOutStat(MCG_Type * base)
{
    return (mcg_clkout_stat_t)MCG_BRD_S_CLKST(base);
}

/*!
 * @brief Sets the Low Power Select.
 *
 * This function  controls whether the FLL (or PLL) is disabled in the BLPI and the
 * BLPE modes. In the FBE or the PBE modes, setting this bit to 1  transitions the MCG
 * into the BLPE mode. In the FBI mode, setting this bit to 1  transitions the MCG into
 * the BLPI mode. In any other MCG mode, the LP bit has no effect.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   Enable low power or not:
 *                 - true: FLL (or PLL) is not disabled in bypass modes
 *                 - false: FLL (or PLL) is disabled in bypass modes (lower power)
 */
static inline void CLOCK_HAL_SetLowPowerModeCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C2_LP(base, enable);
}

#if FSL_FEATURE_MCG_USE_OSCSEL
/*!
 * @brief Sets the MCG OSC Clock Select Setting.
 *
 * This function selects the MCG external reference clock.
 *
 * @param base  Base address for current MCG instance.
 * @param setting  MCG OSC Clock Select Setting
 *                  - 0: Selects System Oscillator (OSCCLK).
 *                  - 1: Selects 32 kHz RTC Oscillator.
 */
static inline void CLOCK_HAL_SetOscselMode(MCG_Type * base, mcg_oscsel_select_t setting)
{
    MCG_WR_C7_OSCSEL(base, setting);
}
#endif

/*@}*/

/*! @name MCG FLL API */
/*@{*/

/*!
 * @brief Gets the FLL source status.
 *
 * This function  gets the Internal Reference Status. This bit indicates the current
 * source for the FLL reference clock. The IREFST bit does not update immediately
 * after a write to the IREFS bit due to internal synchronization between the clock
 * domains.
 *
 * @param base  Base address for current MCG instance.
 * @return Internal Reference Status
 *                 - 0: Source of FLL reference clock is the external reference clock.
 *                 - 1: Source of FLL reference clock is the internal reference clock.
 */
static inline mcg_fll_src_t CLOCK_HAL_GetFllSrc(MCG_Type * base)
{
    return (mcg_fll_src_t)MCG_BRD_S_IREFST(base);
}

/*!
 * @brief Sets the FLL Filter Preserve Enable Setting.
 *
 * This function  sets the FLL Filter Preserve Enable. This bit  prevents the
 * FLL filter values from resetting allowing the FLL output frequency to remain the
 * same during the clock mode changes where the FLL/DCO output is still valid. 
 * (Note: This requires that the FLL reference frequency  remain the same as 
 *  the value prior to the new clock mode switch. Otherwise, the FLL filter and the frequency 
 * values  change.)
 *
 * @param base  Base address for current MCG instance.
 * @param enable  FLL Filter Preserve Enable Setting
 *                 - true: FLL filter and FLL frequency retain their previous values 
 *                       during new clock mode change
 *                 - false: FLL filter and FLL frequency will reset on changes to correct 
 *                       clock mode
 */
static inline void CLOCK_HAL_SetFllFilterPreserveCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_SC_FLTPRSRV(base, enable);
}

/*!
 * @brief Calculates the proper FRDIV setting.
 *
 * This function calculates the proper FRDIV setting according to the FLL
 * reference clock. FLL reference clock frequency after FRDIV must be in the
 * range of 31.25 kHz to 39.0625 kHz.
 *
 * @param range0 RANGE0 setting.
 * @param oscsel OSCSEL setting.
 * @param inputFreq The reference clock frequency before FRDIV.
 * @param frdiv FRDIV result.
 * @return Method return status.
 * @retval kStatus_MCG_Success Proper FRDIV is got.
 * @retval kStatus_MCG_Fail Could not get proper FRDIV.
 */
mcg_status_t CLOCK_HAL_GetAvailableFrdiv(osc_range_t range0,
                                    mcg_oscsel_select_t oscsel,
                                    uint32_t inputFreq,
                                    uint8_t  *frdiv);

/*@}*/

/*! @name MCG internal reference clock APIs */
/*@{*/

/*!
 * @brief Sets the internal reference clock enable or not.
 *
 * This function  enables/disables the internal reference clock to use as the MCGIRCLK.
 *
 * @param base  Base address for current MCG instance.
 * @param enable Enable or disable internal reference clock.
 *                 - true: MCGIRCLK active
 *                 - false: MCGIRCLK inactive
 */
static inline void CLOCK_HAL_SetInternalRefClkEnableCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C1_IRCLKEN(base, enable);
}

/*!
 * @brief Sets the internal reference clock enable or nor in stop mode.
 *
 * This function  controls whether or not the internal reference clock remains 
 * enabled when the MCG enters Stop mode.
 *
 * @param base  Base address for current MCG instance.
 * @param enable Enable or disable the internal reference clock stop setting.
 *                 - true: Internal reference clock is enabled in Stop mode if IRCLKEN is set
 *                         or if MCG is in FEI, FBI, or BLPI modes before entering Stop mode.
 *                 - false: Internal reference clock is disabled in Stop mode
 */
static inline void CLOCK_HAL_SetInternalRefClkEnableInStopCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C1_IREFSTEN(base, enable);
}

/*!
 * @brief Sets the Internal Reference Clock Select.
 *
 * This function selects between the fast or slow internal reference clock source.
 *
 * @param base  Base address for current MCG instance.
 * @param mode Internal reference clock source.
 *                 - 0: Slow internal reference clock selected.
 *                 - 1: Fast internal reference clock selected.
 */
static inline void CLOCK_HAL_SetInternalRefClkMode(MCG_Type * base,
                                                   mcg_irc_mode_t mode)
{
    MCG_BWR_C2_IRCS(base, mode);
}

/*!
 * @brief Gets the Internal Reference Clock Status.
 *
 * This function  gets the Internal Reference Clock Status. The IRCST bit indicates the
 * current source for the internal reference clock select clock (IRCSCLK). The IRCST bit
 * does not update immediately after a write to the IRCS bit due to the internal 
 * synchronization between clock domains. The IRCST bit is only  updated if the 
 * internal reference clock is enabled, either by the MCG being in a mode that uses the
 * IRC or by setting the C1[IRCLKEN] bit.
 *
 * @param base  Base address for current MCG instance.
 * @return Internal Reference Clock Status
 *                 - 0: Source of internal reference clock is the slow clock (32 kHz IRC).
 *                 - 1: Source of internal reference clock is the fast clock (2 MHz IRC).
 */
static inline mcg_irc_mode_t CLOCK_HAL_GetInternalRefClkMode(MCG_Type * base)
{
    return (mcg_irc_mode_t)MCG_BRD_S_IRCST(base);
}

/*!
 * @brief Updates the Fast Clock Internal Reference Divider Setting.
 *
 * This function sets FCRDIV to a new value. FCRDIV cannot be
 * changed when fast internal reference is enabled. 
 * If it is enabled, disable it , then set FCRDIV, and finally re enable
 * it.
 *
 * @param base  Base address for current MCG instance.
 * @param fcrdiv  Fast Clock Internal Reference Divider Setting
 */
void CLOCK_HAL_UpdateFastClkInternalRefDiv(MCG_Type * base, uint8_t fcrdiv);

/*@}*/

/*! @name MCG PLL APIs */
/*@{*/

#if FSL_FEATURE_MCG_HAS_PLL
/*!
 * @brief Sets the PLL Clock Enable Setting.
 *
 * This function  enables/disables the PLL0 independent of the PLLS and enables the PLL0
 * clock to use as the MCGPLL0CLK and the MCGPLL0CLK2X. (PRDIV0 needs to be programmed to
 * the correct divider to generate a PLL1 reference clock in a valid reference range
 * prior to setting the PLLCLKEN0 bit). Setting PLLCLKEN0  enables the external 
 * oscillator selected by REFSEL if not already enabled. Whenever the PLL0 is being
 * enabled with the PLLCLKEN0 bit, and the external oscillator is being used
 * as the reference clock, the OSCINIT 0 bit should be checked to make sure it is set.
 *
 * @param base  Base address for current MCG instance.
 * @param enable  PLL Clock Enable Setting
 *                 - true: MCGPLL0CLK and MCGPLL0CLK2X are active
 *                 - false: MCGPLL0CLK and MCGPLL0CLK2X are inactive
 */
static inline void CLOCK_HAL_SetPll0EnableCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C5_PLLCLKEN0(base, enable);
}

/*!
 * @brief Sets the PLL0 enable or not in STOP mode.
 *
 * This function  enables/disables the PLL0 Clock during a Normal Stop (In Low
 * Power Stop mode, the PLL0 clock gets disabled even if PLLSTEN0=1). In all other
 * power modes, the PLLSTEN0 bit has no affect and does not enable the PLL0 Clock 
 * to run if it is written to 1.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   PLL0 Stop Enable Setting
 *                  - true: MCGPLL0CLK and MCGPLL0CLK2X are enabled if system is in
 *                       Normal Stop mode.
 *                  - false: MCGPLL0CLK and MCGPLL0CLK2X are disabled in any of the 
 *                       Stop modes.
 */
static inline void CLOCK_HAL_SetPll0EnableInStopCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C5_PLLSTEN0(base, enable);
}

/*!
 * @brief Gets the Loss of the Lock Status.
 *
 * This function  gets the Loss of Lock Status. This bit is a sticky bit indicating
 * the lock status for the PLL. LOLS 0 is set if after acquiring lock, the PLL 
 * output frequency has fallen outside the lock exit frequency tolerance.
 *
 * @param base  Base address for current MCG instance.
 * @return True if PLL0 has lost lock since LOLS 0 was last cleared.
 */
static inline bool CLOCK_HAL_IsPll0LostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_S_LOLS0(base);
}

/*!
 * @brief Clears the PLL0 lost lock status.
 *
 * This function clears the Loss of Lock Status.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearPll0LostLock(MCG_Type * base)
{
    MCG_BWR_S_LOLS0(base, 1U);
}

/*!
 * @brief Sets the loss of lock interrupt enable setting.
 *
 * This function determines whether an interrupt request is made following a loss
 * of lock indication. This bit only has an effect when LOLS 0 is set.
 *
 * @param base  Base address for current MCG instance.
 * @param enable  Loss of Lock Interrupt Enable Setting
 *                 - true: Generate an interrupt request on loss of lock.
 *                 - false: No interrupt request is generated on loss of lock.
 */
static inline void CLOCK_HAL_SetPll0LostLockIntCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C6_LOLIE0(base, enable);
}

