m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
#if FSL_FEATURE_MCG_HAS_LOLRE
/*!
 * @brief Sets the PLL Loss of Lock Reset Enable Setting.
 *
 * This function  determines whether an interrupt or a reset request is made
 * following a PLL loss of lock.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   PLL Loss of Lock Reset Enable Setting
 *                  - true: Generate a reset request on a PLL loss of lock indication.
 *                  - false: Interrupt request is generated on a PLL loss of lock
 *                       indication. The PLL loss of lock interrupt enable bit
 *                       must also be set to generate the interrupt request.
 */
static inline void CLOCK_HAL_SetPllLostLockResetCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C8_LOLRE(base, enable);
}
#endif /* FSL_FEATURE_MCG_HAS_LOLRE */

/*!
 * @brief Gets the Lock Status.
 *
 * This function  gets the Lock Status. This bit indicates whether the PLL0 has 
 * acquired the lock. Lock detection is disabled when not operating in either the PBE or the
 * PEE mode unless PLLCLKEN0=1 and the MCG is not configured in the BLPI or the BLPE mode.
 * While the PLL0 clock is locking to the desired frequency, MCGPLL0CLK and 
 * MCGPLL0CLK2X are  gated off until the LOCK0 bit gets asserted. If the lock
 * status bit is set, changing the value of the PRDIV0[2:0] bits in the C5 register
 * or the VDIV0[4:0] bits in the C6 register causes the lock status bit to clear 
 * and stay cleared until the PLL0 has reacquired the lock. The loss of the PLL0 reference 
 * clock  also causes the LOCK0 bit to clear until the PLL0 has an entry into the LLS, 
 * VLPS, or a regular Stop with PLLSTEN0=0 also causes the lock status bit to clear
 * and stay cleared until the stop mode is exited and the PLL0 has reacquired the lock.
 * Any time the PLL0 is enabled and the LOCK0 bit is cleared, the MCGPLL0CLK and
 * MCGPLL0CLK2X are  gated off until the LOCK0 bit is reasserted.
 *
 * @param base  Base address for current MCG instance.
 * @return True if PLL0 is locked.
 */
static inline bool CLOCK_HAL_IsPll0Locked(MCG_Type * base)
{
    return (bool)MCG_BRD_S_LOCK0(base);
}

/*!
 * @brief Selects the PLL output or FLL output as the source of the MCGOUT.
 *
 * This function selects the PLL output or FLL output as the source of the
 * MCGOUT. When this is  set, use the CLOCK_HAL_IsPllSelected to check the status
 * update.
 *
 * @param base  Base address for current MCG instance.
 * @param select True to select PLL, false to select FLL.
 */
static inline void CLOCK_HAL_SetPllSelectCmd(MCG_Type * base, bool select)
{
    MCG_BWR_C6_PLLS(base, select);
}

/*!
 * @brief Gets the PLL Select Status.
 *
 * This function  gets the PLL Select Status. This bit indicates the clock source
 * selected by PLLS . The PLLST bit does not update immediately after a write to
 * the PLLS bit due to the internal synchronization between the clock domains.
 *
 * @param base  Base address for current MCG instance.
 * @return True if PLL output is selected to MCGOUT, false if FLL output is selected.
 */
static inline bool CLOCK_HAL_IsPllSelected(MCG_Type * base)
{
    return (bool)MCG_BRD_S_PLLST(base);
}

/*!
 * @brief Enables the PLL0 not in PLL mode.
 *
 * This function enables the PLL0 when MCG is not in the PLL mode, for example,
 * when the MCG is in FEI mode. This function only sets up the PLL dividers and makes
 * sure the PLL is locked. Ensure the PLL reference clock is enabled
 * before calling this function. The function CLOCK_HAL_CalculatePllDiv can help to
 * get the proper PLL divider values.
 *
 * @param base  Base address for current MCG instance.
 * @param prdiv PLL reference divider.
 * @param vdiv  PLL VCO divider.
 * @param enableInStop  PLL enable or not in STOP mode.
 */
void CLOCK_HAL_EnablePll0InFllMode(MCG_Type * base,
                                   uint8_t prdiv,
                                   uint8_t vdiv,
                                   bool enableInStop);
#endif

#if FSL_FEATURE_MCG_HAS_PLL1
/*!
 * @brief Sets the PLL1 Clock Enable Setting.
 *
 * This function  enables/disables the PLL1 independent of PLLS and enables the
 * PLL clocks for use as MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X. (PRDIV1 needs 
 * to be programmed to the correct divider to generate a PLL1 reference clock in a
 * valid reference range prior to setting the PLLCLKEN1 bit.) Setting PLLCLKEN1 
 *  enables the PLL1 selected external oscillator if not already enabled. 
 * Whenever the PLL1 is  enabled with the PLLCLKEN1 bit, and the 
 * external oscillator is  used as the reference clock, the OSCINIT1 bit should
 * be checked to make sure it is set.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   PLL1 Clock Enable Setting
 *                  - true: MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X are active unless
 *                       MCG is in a bypass mode with LP=1 (BLPI or BLPE).
 *                  - false: MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X are inactive.
 */
static inline void CLOCK_HAL_SetPll1EnableCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C11_PLLCLKEN1(base, enable);
}

/*!
 * @brief Sets the PLL1 enable or not in STOP mode.
 *
 * This function  enables/disables the PLL1 Clock during the Normal Stop (In Low
 * Power Stop modes, the PLL1 clock gets disabled even if PLLSTEN1=1. In all other 
 * power modes, PLLSTEN1 bit has no affect and does not enable the PLL1 Clock to
 * run if it is written to 1.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   PLL1 Stop Enable Setting
 *                  - true: PLL1 and its clocks (MCGPLL1CLK, MCGPLL1CLK2X, and 
 *                       MCGDDRCLK2X) are enabled if system is in Normal Stop mode.
 *                  - false: PLL1 clocks (MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X) 
 *                       are disabled in any of the Stop modes.
 */
static inline void CLOCK_HAL_SetPll1EnableInStopCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C11_PLLSTEN1(base, enable);
}

/*!
 * @brief Sets the PLL1 Loss of Lock Interrupt Enable Setting.
 *
 * This function  determines whether an interrupt request is made following a 
 * loss of lock indication for PLL1. This bit only has an affect when LOLS1 is set.
 *
 * @param base  Base address for current MCG instance.
 * @param enable   PLL1 Loss of Lock Interrupt Enable Setting
 *                  - true: Generate an interrupt request on loss of lock on PLL1.
 *                  - false: No interrupt request is generated on loss of lock on PLL1.
 */
static inline void CLOCK_HAL_SetPll1LostLockIntCmd(MCG_Type * base, bool enable)
{
    MCG_BWR_C12_LOLIE1(base, enable);
}

/*!
 * @brief Gets the Loss of the Lock2 Status.
 *
 * This function  gets the Loss of the Lock2 Status. This bit  indicates
 * the lock status for the PLL1. LOLS1 is set if after acquiring lock, the PLL1 
 * output frequency has fallen outside the lock exit frequency tolerance, D unl. 
 * LOLIE1 determines whether an interrupt request is made when LOLS1 is set. This
 * bit is cleared by reset or by writing a logic 1 to it when set. Writing a logic 0
 * to this bit has no effect.
 *
 * @param base  Base address for current MCG instance.
 * @return True if PLL1 has lost lock since LOLS 1 was last cleared.
 */
static inline bool CLOCK_HAL_IsPll1LostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_S2_LOLS1(base);
}

/*!
 * @brief Clears the PLL1 lost lock status.
 *
 * This function clears the Loss of Lock Status.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearPll1LostLock(MCG_Type * base)
{
    MCG_BWR_S2_LOLS1(base, 1U);
}

/*!
 * @brief Gets the Lock1 Status.
 *
 * This function  gets the Lock1 Status. This bit indicates whether PLL1 has 
 * acquired the lock. PLL1 Lock detection is disabled when not operating in either
 * PBE or PEE mode unless the PLLCLKEN1=1 and the the MCG is not configured in the BLPI or the
 * BLPE mode. While the PLL1 clock is locking to the desired frequency, MCGPLL1CLK,
 * MCGPLL1CLK2X, and MCGDDRCLK2X  are gated off until the LOCK1 bit gets 
 * asserted. If the lock status bit is set, changing the value of the PRDIV1[2:0] 
 * bits in the C8 register or the VDIV2[4:0] bits in the C9 register causes the
 * lock status bit to clear and stay cleared until the PLL1 has reacquired lock. 
 * Loss of PLL1 reference clock also causes the LOCK1 bit to clear until the PLL1 
 * has reacquired the lock. Entry into the LLS, VLPS, or a regular Stop with the PLLSTEN1=0 also
 * causes the lock status bit to clear and stay cleared until the Stop mode is exited
 * and the PLL1 has reacquired the lock. Any time the PLL1 is enabled and the LOCK1 bit
 * is cleared, the MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X  are gated off 
 * until the LOCK1 bit is asserted again.
 *
 * @param base  Base address for current MCG instance.
 * @return True if PLL1 is locked.
 */
static inline bool CLOCK_HAL_IsPll1Locked(MCG_Type * base)
{
    return (bool)MCG_BRD_S2_LOCK1(base);
}
#endif /* FSL_FEATURE_MCG_HAS_PLL1 */

