m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
#if (FSL_FEATURE_MCG_HAS_PLL1 || FSL_FEATURE_MCG_HAS_EXTERNAL_PLL)
/*!
 * @brief Sets the PLL Clock Select Setting.
 *
 * This function  controls  whether the PLL0 or PLL1/ExtPLL output is selected as the
 * MCG source when CLKS are programmed in PLL Engaged External (PEE) mode 
 * (CLKS[1:0]=00 and IREFS=0 and PLLS=1).
 *
 * @param base  Base address for current MCG instance.
 * @param setting  PLL Clock Select Setting
 *                  - 0: PLL0 output clock is selected.
 *                  - 1: PLL1/ExtPLL output clock is selected.
 */
static inline void CLOCK_HAL_SetPllClkSelMode(MCG_Type * base, mcg_pll_clk_select_t setting)
{
    MCG_BWR_C11_PLLCS(base, setting);
}

/*!
 * @brief Gets the PLL Clock Select Status.
 *
 * This function  gets the PLL Clock Select Status. The PLLCST indicates the PLL
 * clock selected by PLLCS. The PLLCST bit is not updated immediately after a
 * write to the PLLCS bit due internal synchronization between clock domains.
 *
 * @param base  Base address for current MCG instance.
 * @return PLL Clock Select Status
 *                 - 0: Source of PLLCS is PLL0 clock.
 *                 - 1: Source of PLLCS is PLL1/ExtPLL clock.
 */
static inline mcg_pll_clk_select_t CLOCK_HAL_GetPllClkSelMode(MCG_Type * base)
{
    return (mcg_pll_clk_select_t)MCG_BRD_S2_PLLCST(base);
}
#endif /* FSL_FEATURE_MCG_HAS_PLL1 || FSL_FEATURE_MCG_HAS_EXTERNAL_PLL */

#if FSL_FEATURE_MCG_HAS_PLL1
/*!
 * @brief Enables the PLL1 not in PLL mode.
 *
 * This function enables the PLL1 when MCG is not in PLL modes, for example,
 * when MCG is in FEI mode. This function only sets up the PLL dividers and makes
 * sure PLL is locked. Ensure the PLL reference clock is enabled
 * before this function. The function CLOCK_HAL_CalculatePllDiv  helps to
 * get the proper PLL divider values.
 *
 * @param base  Base address for current MCG instance.
 * @param prdiv PLL reference divider.
 * @param vdiv  PLL VCO divider.
 * @param enableInStop  PLL enable or not in STOP mode.
 */
void CLOCK_HAL_EnablePll1InFllMode(MCG_Type * base,
                                   uint8_t prdiv,
                                   uint8_t vdiv,
                                   bool enableInStop);

#if FSL_FEATURE_MCG_USE_PLLREFSEL
/*!
 * @brief Sets the PLL0 External Reference Select Setting.
 *
 * This function  selects the PLL0 external reference clock source.
 *
 * @param base Base address for current MCG instance.
 * @param setting  PLL0 External Reference Select Setting
 *                  - 0: Selects OSC0 clock source as its external reference clock
 *                  - 1: Selects OSC1 clock source as its external reference clock
 */
static inline void CLOCK_HAL_SetPll0RefMode(MCG_Type * base,
                                            mcg_pll_ref_mode_t setting)
{
    BW_MCG_C5_PLLREFSEL0(base, setting);
}

/*!
 * @brief Sets the PLL1 External Reference Select Setting.
 *
 * This function  selects the PLL1 external reference clock source.
 *
 * @param base Base address for current MCG instance.
 * @param setting  PLL1 External Reference Select Setting
 *                  - 0: Selects OSC0 clock source as its external reference clock.
 *                  - 1: Selects OSC1 clock source as its external reference clock.
 */
static inline void CLOCK_HAL_SetPll1RefMode(MCG_Type * base,
                                            mcg_pll_ref_mode_t setting)
{
    BW_MCG_C11_PLLREFSEL1(base, setting);
}
#endif /* FSL_FEATURE_MCG_USE_PLLREFSEL */

#endif /* FSL_FEATURE_MCG_HAS_PLL1 */

/*@}*/

/*! @name MCG OSC APIs */
/*@{*/

/*!
 * @brief Sets the OSC0 work mode.
 *
 * This function sets the OSC0 work mode, include frequency range select, high gain
 * oscillator select, and external reference select.
 *
 * @param base  Base address for current MCG instance.
 * @param range     Frequency range select.
 * @param hgo       High gain oscillator select.
 * @param erefs     External reference select.
 */
void CLOCK_HAL_SetOsc0Mode(MCG_Type * base,
                           osc_range_t range,
                           osc_gain_t hgo,
                           osc_src_t erefs);

/*!
 * @brief Gets the OSC Initialization Status.
 *
 * This function  gets the OSC Initialization Status. This bit, which resets to 0, is set
 * to 1 after the initialization cycles of the crystal oscillator clock have completed.
 * After being set, the bit is cleared to 0 if the OSC is subsequently disabled. See the
 * OSC module's detailed description for more information.
 *
 * @param base  Base address for current MCG instance.
 * @return True if OSC0 is stable.
 */
static inline bool CLOCK_HAL_IsOsc0Stable(MCG_Type * base)
{
    return (bool)MCG_BRD_S_OSCINIT0(base);
}

/*!
 * @brief Enables the OSC0 external clock monitor.
 *
 * This function enables the loss of clock monitoring circuit for the OSC0
 * external reference mux select. The monitor mode determines whether an
 * interrupt or a reset request is generated following a loss of the OSC0 indication.
 * External clock monitor should only be enabled when the MCG is in an operational
 * mode that uses the external clock (FEE, FBE, PEE, PBE, or BLPE). Whenever the
 * monitor is enabled, the value of the RANGE0 bits in the C2 register
 * should not be changed. External clock monitor should be disabled before the MCG
 * enters any Stop mode. Otherwise, a reset request may occur while in Stop mode.
 * External clock monitor should also be disabled before entering VLPR or VLPW
 * power modes if the MCG is in BLPE mode.
 *
 * @param base  Base address for current MCG instance.
 * @param mode Generate interrupt or reset when OSC loss detected.
 */
void CLOCK_HAL_EnableOsc0Monitor(MCG_Type * base, mcg_osc_monitor_mode_t mode);

/*!
 * @brief Disables the OSC0 external clock monitor.
 *
 * This function disables the loss of clock monitoring circuit for the OSC0
 * external reference mux select.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_DisableOsc0Monitor(MCG_Type * base)
{
    MCG_BWR_C6_CME0(base, 0U);
}

/*!
 * @brief Checks the OSC0 external clock monitor is enabled or not.
 *
 * This function checks whether the loss of clock monitoring circuit for the OSC0
 * external reference mux select is enabled or not.
 *
 * @param base  Base address for current MCG instance.
 * @return True if monitor is enabled.
 */
static inline bool CLOCK_HAL_IsOsc0MonitorEnabled(MCG_Type * base)
{
    return (bool)MCG_BRD_C6_CME0(base);
}

/*!
 * @brief Gets the OSC0 Loss of Clock Status.
 *
 * This function  gets the OSC0 Loss of Clock Status. The LOCS0 indicates when a loss of
 * OSC0 reference clock has occurred. The LOCS0 bit only has an effect when CME0 is set.
 *
 * @param base  Base address for current MCG instance.
 * @return True if loss of OSC0 has occurred.
 */
static inline bool CLOCK_HAL_IsOsc0LostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_SC_LOCS0(base);
}

/*!
 * @brief Clears the OSC0 Loss of Clock Status.
 *
 * This function clears the OSC0 Loss of Clock Status.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearOsc0LostLock(MCG_Type * base)
{
    MCG_BWR_SC_LOCS0(base, 1U);
}

#if FSL_FEATURE_MCG_HAS_RTC_32K
/*!
 * @brief Enables the RTC OSC external clock monitor.
 *
 * This function enables the loss of the clock monitoring circuit for the
 * output of the RTC external reference clock. The LOCRE1 bit  determines whether an
 * interrupt or a reset request is generated following a loss of the RTC clock indication.
 * The monitor should only be enabled when the MCG is in an operational mode
 * that uses the external clock (FEE, FBE, PEE, PBE, or BLPE). Monitor must be disabled
 * before the MCG enters any Stop mode. Otherwise, a reset request may occur
 * while in Stop mode. The monitor should also be disabled before entering VLPR or
 * VLPW power modes if the MCG is in BLPE mode.
 *
 * @param base  Base address for current MCG instance.
 * @param mode Generate interrupt or reset when RTC OSC loss detected.
 */
void CLOCK_HAL_EnableRtcOscMonitor(MCG_Type * base, mcg_osc_monitor_mode_t mode);

/*!
 * @brief Disables the RTC OSC external clock monitor.
 *
 * This function disables the loss of clock monitoring circuit for the RTC OSC
 * external reference mux select.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_DisableRTCOscMonitor(MCG_Type * base)
{
    MCG_BWR_C8_CME1(base, 0U);
}

/*!
 * @brief Checks the OSC RTC external clock monitor is enabled or not.
 *
 * This function checks whether the loss of clock monitoring circuit for the OSC
 * RTC external reference mux select is enabled or not.
 *
 * @param base  Base address for current MCG instance.
 * @return True if monitor is enabled.
 */
static inline bool CLOCK_HAL_IsRtcOscMonitorEnabled(MCG_Type * base)
{
    return (bool)MCG_BRD_C8_CME1(base);
}

/*!
 * @brief Gets the RTC Loss of Clock Status.
 *
 * This function  gets the RTC Loss of Clock Status. This bit indicates when a loss
 * of clock has occurred. This bit is cleared by writing a logic 1 to it when set.
 *
 * @param base  Base address for current MCG instance.
 * @return True if loss of RTC has occurred
 */
static inline bool CLOCK_HAL_IsRtcOscLostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_C8_LOCS1(base);
}

/*!
 * @brief Clears the RTC Loss of Clock Status.
 *
 * This function clears the RTC Loss of Clock Status.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearRtcOscLostLock(MCG_Type * base)
{
    MCG_BWR_C8_LOCS1(base, 1U);
}
#endif /* FSL_FEATURE_MCG_HAS_RTC_32K */

