m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/inc/fsl_mcg_hal.h
#if FSL_FEATURE_MCG_HAS_OSC1
/*!
 * @brief Sets the OSC0 work mode.
 *
 * This function sets the OSC0 work mode, includes the frequency range select, high gain
 * oscillator select and external reference select.
 *
 * @param base  Base address for current MCG instance.
 * @param range     Frequency range select.
 * @param hgo       High gain oscillator select.
 * @param erefs     External reference select.
 */
void CLOCK_HAL_SetOsc1Mode(MCG_Type * base,
                           osc_range_t range,
                           osc_gain_t hgo,
                           osc_src_t erefs);

/*!
 * @brief Gets the OSC1 Initialization Status.
 *
 * This function  gets the OSC1 Initialization Status. This bit is set after the
 * initialization cycles of the 2nd crystal oscillator clock have completed. See
 * the Oscillator block guide for more details.
 *
 * @param base  Base address for current MCG instance.
 * @return True is OSC1 is stable.
 */
static inline bool CLOCK_HAL_IsOsc1Stable(MCG_Type * base)
{
    return (bool)MCG_BRD_S2_OSCINIT1(base);
}

/*!
 * @brief Enables the OSC1 external clock monitor.
 *
 * This function enables the loss of the clock monitor for the OSC1 external
 * reference clock. The monitor mode determines whether a reset or interrupt
 * request is generated following a loss of OSC1 external reference clock.
 * The monitor should only be enabled when the MCG is in an operational mode
 * that uses the external clock (PEE or PBE). Whenever the monitor is enabled,
 * the value of the RANGE1 bits in the C10 register should not be changed.
 * The monitor should be disabled before the MCG enters any Stop mode.
 * Otherwise, a reset request may occur while in stop mode.
 *
 * @param base  Base address for current MCG instance.
 * @param mode Generate interrupt or reset when OSC loss detected.
 */
void CLOCK_HAL_EnableOsc1Monitor(MCG_Type * base, mcg_osc_monitor_mode_t mode);

/*!
 * @brief Disables the OSC1 external clock monitor.
 *
 * This function disables the loss of clock monitoring circuit for the OSC1
 * external reference mux select.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_DisableOsc1Monitor(MCG_Type * base)
{
    MCG_BWR_C12_CME2(base, 0U);
}

/*!
 * @brief Checks the OSC1 external clock monitor is enabled or not.
 *
 * This function checks whether the loss of clock monitoring circuit for the OSC1
 * external reference mux select is enabled or not.
 *
 * @param base  Base address for current MCG instance.
 * @return True if monitor is enabled.
 */
static inline bool CLOCK_HAL_IsOsc1MonitorEnabled(MCG_Type * base)
{
    return (bool)MCG_BRD_C12_CME2(base);
}


/*!
 * @brief Gets the OSC1 Loss of Clock Status.
 *
 * This function gets the OSC1 Loss of Clock Status. This bit indicates when a loss
 * of the OSC1 external reference clock has occurred.
 *
 * @param base Base address for current MCG instance.
 * @return True if loss of OSC1 external reference clock has occurred.
 */
static inline bool CLOCK_HAL_IsOsc1LostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_S2_LOCS2(base);
}

/*!
 * @brief Clears the OSC1 Loss of Clock Status.
 *
 * This function clears the OSC1 Loss of Clock Status.
 *
 * @param base Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearOsc1LostLock(MCG_Type * base)
{
    MCG_BWR_S2_LOCS2(base, 1U);
}
#endif

#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
/*!
 * @brief Enables the External PLL Clock monitor.
 *
 * This function enables the loss of the clock monitor for the External PLL
 * clock. The monitor mode determines whether a reset or interrupt
 * request is generated following a loss of EXT_PLL clock.
 * The monitor should only be enabled when the MCG is in an operational mode
 * that uses the EXT_PLL clock as CLKS source (PEE or PBE).
 *
 * @param base  Base address for current MCG instance.
 * @param mode Generate interrupt or reset when OSC loss detected.
 */
void CLOCK_HAL_EnableExtPllMonitor(MCG_Type * base, mcg_osc_monitor_mode_t mode);

/*!
 * @brief Disables the External PLL clock monitor.
 *
 * This function disables the loss of clock monitoring circuit for the External PLL
 * external reference mux select.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_DisableExtPllMonitor(MCG_Type * base)
{
    MCG_BWR_C9_PLL_CME(base, 0U);
}

/*!
 * @brief Checks the External PLL clock monitor is enabled or not.
 *
 * This function checks whether the loss of clock monitoring circuit for the External PLL
 * clock is enabled or not.
 *
 * @param base  Base address for current MCG instance.
 * @return True if monitor is enabled.
 */
static inline bool CLOCK_HAL_IsExtPllMonitorEnabled(MCG_Type * base)
{
    return (bool)MCG_BRD_C9_PLL_CME(base);
}


/*!
 * @brief Gets the External PLL Loss of Clock Status.
 *
 * This function gets the External PLL Loss of Clock Status. This bit indicates when a loss
 * of the External PLL clock has occurred.
 *
 * @param base Base address for current MCG instance.
 * @return True if loss of External PLL clock has occurred.
 */
static inline bool CLOCK_HAL_IsExtPllLostLock(MCG_Type * base)
{
    return (bool)MCG_BRD_C9_EXT_PLL_LOCS(base);
}

/*!
 * @brief Clears the External PLL Loss of Clock Status.
 *
 * This function clears the External PLL Loss of Clock Status.
 *
 * @param base Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearExtPllLostLock(MCG_Type * base)
{
    MCG_BWR_C9_EXT_PLL_LOCS(base, 1U);
}
#endif
/*@}*/

/*! @name MCG Auto Trim Machine (ATM) */
/*@{*/

/*!
 * @brief Auto trims the internal reference clock.
 *
 * This function trims the internal reference clock using external clock. If
 * successful, it returns the kMcgAtmErrorNone and the frequency after trimming is received
 * in the parameter actualFreq. If an error occurs, the error code is returned.
 *
 * @param base     Base address for current MCG instance.
 * @param extFreq      External clock frequency, should be bus clock.
 * @param desireFreq   Frequency want to trim to.
 * @param actualFreq   Actual frequency after trim.
 * @param atms         Trim fast or slow internal reference clock.
 * @return  Return kMcgAtmErrorNone if success, otherwise return error code.
 */
mcg_atm_error_t CLOCK_HAL_TrimInternalRefClk(MCG_Type* base,
                                             uint32_t  extFreq,
                                             uint32_t  desireFreq,
                                             uint32_t* actualFreq,
                                             mcg_atm_select_t atms);

/*!
 * @brief Gets the Automatic Trim machine Fail Flag.
 *
 * This function  gets the Automatic Trim machine Fail Flag. This bit asserts when the 
 * Automatic Trim Machine is
 * enabled (ATME=1) and a write to the C1, C3, C4, and SC registers is detected or the MCG
 * enters into a Stop mode. Writing to ATMF clears the flag.
 *
 * @param base  Base address for current MCG instance.
 * @return True if ATM failed.
 */
static inline bool CLOCK_HAL_IsAutoTrimMachineFailed(MCG_Type * base)
{
    return (bool)MCG_BRD_SC_ATMF(base);
}

/*!
 * @brief Clears the Automatic Trim machine Fail Flag.
 *
 * This function clears the Automatic Trim machine Fail Flag.
 *
 * @param base  Base address for current MCG instance.
 */
static inline void CLOCK_HAL_ClearAutoTrimMachineFailed(MCG_Type * base)
{
    MCG_BWR_SC_ATMF(base, 1U);
}

/*@}*/

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif
#endif /* __FSL_MCG_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

